tap "fluxcd/tap"

cask "1password"
cask "1password-cli"
cask "affinity"
cask "alfred"
cask "autodesk-fusion"
cask "discord"
cask "font-hack-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "iina"
cask "llamabarn"
cask "mactex"
cask "microsoft-teams"
cask "miniconda"
cask "proton-drive"
cask "proton-mail-bridge"
cask "protonvpn"
cask "prusaslicer"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zed"

brew "age"
brew "bash"
brew "bat"
brew "btop"
brew "cmatrix"
brew "duf"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "gum"
brew "helm"
brew "helmfile"
brew "hugo"
brew "jq"
brew "just"
brew "kubernetes-cli"
brew "krew"
brew "kubecolor"
brew "mas"
brew "micro"
brew "mise"
brew "mole"
brew "node"
brew "pipx"
brew "pre-commit"
brew "sops"
brew "starship"
brew "stow"
brew "talhelper"
brew "talosctl"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "fluxcd/tap/flux"

mas "1Password for Safari", id: 1569813296
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spool Buddy", id: 6752347588
mas "WireGuard", id: 1451685025

krew "cnpg"
krew "rook-ceph"
krew "view-secret"
